app/Http/Controllers/Hrd/JabatanController.php

select * from `jabatan`
---
    function tampilJabatan(){
        $data = Jabatan::all();

select count(*) as aggregate from `jabatan`
---
    function tambahJabatan(){
        $id_jabatan = Jabatan::count()+1;

insert into `jabatan` (`nama_jabatan`) values ('Tes')
---
    function storeJabatan(Request $request){
        $request->validate([
            'namajabatan'=>'required',
        ]);

        Jabatan::create([
            'nama_jabatan' => $request->namajabatan,
        ]);