app/Http/Controllers/Hrd/KaryawanController.php

select * from `karyawan` left join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan`
---
    function tampilKaryawan(){
        $data = Karyawan::leftjoin('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')->get();

select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where `status_slip` = 1 and `total_tmakan` > 0
---
    function tampilSlip(){
        $gaji = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')
        ->join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where('status_slip', 2)
        ->where('total_tmakan', '>', 0)
        ->get();

select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where `transaksi`.`id_gaji` = '44' limit 1
---
    function print($id){
        $cetak = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')
        ->join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where('transaksi.id_gaji', $id)
        ->first();