app/Http/Controllers/Hrd/PresensiController.php

select * from `karyawan`
---
    function tampilPresensi(){
        $data = Karyawan::all();

select * from `presensi` inner join `karyawan` on `karyawan`.`id_karyawan` = `presensi`.`id_karyawan` where `presensi`.`id_karyawan` = '12' and month(`presensi`.`masuk`) = '10' and year(`presensi`.`masuk`) = '2022' and time(`presensi`.`masuk`) <= '9:00:00' and (`presensi`.`status` = 1 or `presensi`.`status` = 3)
---
    function detailPresensi(Request $request){
        $this->validate($request, [
            'bulan'      => 'required',
            'tahun'      => 'required'
        ]);

        $id    = $request->id_karyawan;
        $bulan = $request->bulan;
        $tahun = $request->tahun;


        $data = Presensi::join('karyawan', 'karyawan.id_karyawan', '=', 'presensi.id_karyawan')
        ->where('presensi.id_karyawan', $id)
        ->whereMonth('presensi.masuk', "=", $bulan)
        ->whereYear('presensi.masuk', "=", $tahun)
        ->whereTime('presensi.masuk', '<=', '9:00:00')
        ->where(function($s){
            $s->where('presensi.status', 1)->orWhere('presensi.status', 3);
        })
        ->get();

select count(*) as aggregate from `presensi` where `id_karyawan` = '12' and month(`masuk`) = '10' and year(`masuk`) = '2022' and (`status` = 1 or `status` = 3) and time(`masuk`) <= '9:00:00'
select * from `presensi` where `id_karyawan` = '12' and `status` = 3 and month(`masuk`) = '10' and year(`masuk`) = '2022' and time(`masuk`) > '17:00:00'
---
        // ->whereTime('keluar', '>', '17:00:00')
        // ->count();

        $hari_kerja = Presensi::where('id_karyawan', $id)
        ->whereMonth('masuk', "=", $bulan)
        ->whereYear('masuk', "=", $tahun)
        ->where(function($d){
            $d->where('status', 1)->orWhere('status', 3);
        })
        ->whereTime('masuk', '<=', '9:00:00')
        ->count();

        $lembur = Presensi::where('id_karyawan', $id)
        ->where('status', 3)
        ->whereMonth('masuk', "=", $bulan)
        ->whereYear('masuk', "=", $tahun)
        ->whereTime('masuk', '>', '17:00:00')
        ->get();