app/Http/Controllers/Manager/LaporanGajiController.php

select YEAR(masuk) as tahun from `presensi` group by `tahun`
---
    function laporanGaji(){
        $tahun = Presensi::selectRaw('YEAR(masuk) as tahun')
        ->groupBy('tahun')
        ->get();

select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where `transaksi`.`tahun` = '2022' and `transaksi`.`bulan` = '10' and `transaksi`.`status_slip` = 1
select sum(`penghasilan_bersih`) as aggregate from `transaksi` where `status_slip` = 1
---
    function printGaji(Request $request){
        $this->validate($request, [
            'tahun' => 'required',
            'bulan' => 'required'
        ]);

        $tahun = $request->tahun;
        $bulan = $request->bulan;
        $data = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')
        ->join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where('transaksi.tahun', $tahun)
        ->where('transaksi.bulan', $bulan)
        ->where('transaksi.status_slip', 2)
        ->get();

        $total_gaji = Transaksi::sum('penghasilan_bersih');