app/Http/Controllers/Manager/LaporanPajakController.php

    function laporanPajak(){
        $tahun = Presensi::selectRaw('YEAR(masuk) as tahun')
        ->groupBy('tahun')
        ->get();
---
select YEAR(masuk) as tahun from `presensi` group by `tahun`

    function laporanBulan(){
        $tahun = Presensi::selectRaw('YEAR(masuk) as tahun')
        ->groupBy('tahun')
        ->get();
---
select YEAR(masuk) as tahun from `presensi` group by `tahun`

    function printPajak(Request $request){
        $this->validate($request,[
            'tahun' => 'required'
        ]);

        $tahun = $request->tahun;
        $data = Karyawan::join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where('transaksi.tahun', $tahun)
        ->where('transaksi.status_slip', 2)
        ->get();

        $total_pajak = Transaksi::sum('pajak_penghasilan');
---
select * from `karyawan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where `transaksi`.`tahun` = '2022' and `transaksi`.`status_slip` = 1
select sum(`pajak_penghasilan`) as aggregate from `transaksi` where `status_slip` = 1

    function printBulan(Request $request){
        $this->validate($request,[
            'bulan' => 'required',
            'tahun' => 'required'
        ]);

        $bulan = $request->bulan;
        $tahun = $request->tahun;
        $data = Karyawan::join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where('transaksi.bulan', $bulan)
        ->where('transaksi.tahun', $tahun)
        ->where('transaksi.status_slip', 2)
        ->get();
---
select * from `karyawan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where `transaksi`.`bulan` = '10' and `transaksi`.`tahun` = '2022' and `transaksi`.`status_slip` = 1