app/Http/Controllers/Manager/ValidasiController.php

select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where (`status_slip` is null or `status_slip` = 1) and `total_tmakan` > 0
---
    function validasiGaji(){
        $data = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')
        ->join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where(function($s) {
            $s->where('status_slip', null)->orWhere('status_slip', 1);
        })
        ->where('total_tmakan', '>', 0)
        ->get();

select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan` inner join `transaksi` on `transaksi`.`id_karyawan` = `karyawan`.`id_karyawan` where `id_gaji` = '44'
---
    function detailSlip($id, Request $request){
        $slip = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')
        ->join('transaksi', 'transaksi.id_karyawan', '=', 'karyawan.id_karyawan')
        ->where('id_gaji', $id)
        ->get();

select * from `transaksi` where `id_gaji` = '44' limit 1
update `transaksi` set `status_slip` = 1 where `id_gaji` = 44
---
    function simpanValidasi(Request $request){
        $request->validate([
            'id_gaji'   => 'required'
        ]);

        $gaji = Transaksi::where('id_gaji', $request->id_gaji)->first();

        $gaji->status_slip = 1;
        $gaji->save();