app/Http/Controllers/Keuangan/GajiController.php

    function tampilGaji(){
        $karyawan = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')->get();
---
select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan`

    function detailGaji($id){
        $id_karyawan = $id;
        $tahun = Presensi::selectRaw('YEAR(masuk) as tahun')
        ->groupBy('tahun')
        ->get();
---
select YEAR(masuk) as tahun from `presensi` group by `tahun`

    function hitungGaji(Request $request){
        $this->validate($request, [
            'bulan'      => 'required',
            'tahun'      => 'required'
        ]);

        $id_karyawan = $request->id_karyawan;
        $bulan = $request->bulan;
        $tahun = $request->tahun;

        $data = Karyawan::join('jabatan', 'jabatan.id_jabatan', '=', 'karyawan.id_jabatan')
        ->where('id_karyawan', $id_karyawan)
        ->get();

        $masuk = Presensi::selectRaw('DATE_FORMAT(masuk, "%M") as bulan')
        ->groupBy('bulan')
        ->get();

        $jht = Iuran::where('id_setting', 1)->first();
        $jp = Iuran::where('id_setting', 2)->first();

        //Jumlah Hari Kerja
        $hari_masuk = Presensi::where('id_karyawan', $id_karyawan)
                                ->where('status', 1)
                                ->whereMonth('masuk', '=', $bulan)
                                ->whereYear('masuk', '=', $tahun)
                                ->whereTime('masuk', '<=', '9:00:00')
                                ->count();
        $hari_lembur = Presensi::where('id_karyawan', $id_karyawan)
        ->where('status', 3)
        ->whereMonth('masuk', '=', $bulan)
        ->whereYear('masuk', '=', $tahun)
        ->whereTime('masuk', '<=', '9:00:00')
        ->count();
        $total_hari = $hari_masuk + $hari_lembur;

        //Jumlah Jam Lembur
        $lembur = Presensi::where('id_karyawan', $id_karyawan)
        ->where('status', 3)
        ->whereMonth('masuk', '=', $bulan)
        ->whereYear('masuk', '=', $tahun)
        ->whereTime('keluar', '>', '17:00:00')
        ->get();
---
select * from `karyawan` inner join `jabatan` on `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan` where `id_karyawan` = '12'
select DATE_FORMAT(masuk, "%M") as bulan from `presensi` group by `bulan`
select * from `setting` where `id_setting` = 1 limit 1
select * from `setting` where `id_setting` = 2 limit 1
select count(*) as aggregate from `presensi` where `id_karyawan` = '12' and `status` = 1 and month(`masuk`) = '01' and year(`masuk`) = '2022' and time(`masuk`) <= '9:00:00'
select count(*) as aggregate from `presensi` where `id_karyawan` = '12' and `status` = 3 and month(`masuk`) = '01' and year(`masuk`) = '2022' and time(`masuk`) <= '9:00:00'
select * from `presensi` where `id_karyawan` = '12' and `status` = 3 and month(`masuk`) = '01' and year(`masuk`) = '2022' and time(`keluar`) > '17:00:00'

            }


            Transaksi::updateOrCreate([
                'id_karyawan' => $id_karyawan,
                'bulan'       => $bulan
            ],[
                'id_karyawan'           => $id_karyawan,
                'bulan'                 => $bulan,
                'tahun'                 => $tahun,
                'lembur'                => $hasil,
                'jumlah_hari'           => $total_hari,
                'total_tmakan'          => $ht_makan,
                'total_ttransportasi'   => $ht_transportasi,
                'upah_lembur'           => $total_upah,
                'penghasilan_bruto'     => $penghasilan_bruto,
                'penghasilan_bersih'    => $penghasilan_bersih,
                'biaya_jabatan'         => $ht_jabatan,
                'jaminan_ht'            => $ht_jht,
                'jaminan_p'             => $ht_jp,
                'pajak_penghasilan'     => $pph,
            ]);
---
insert into `transaksi` (`id_karyawan`, `bulan`, `tahun`, `lembur`, `jumlah_hari`, `total_tmakan`, `total_ttransportasi`, `upah_lembur`, `penghasilan_bruto`, `penghasilan_bersih`, `biaya_jabatan`, `jaminan_ht`, `jaminan_p`, `pajak_penghasilan`) values ('12', '01', '2022', 0, 0, 0, 0, 0, 5500000, 5060000, 275000, 110000, 55000, 0)
select * from `transaksi` where (`id_karyawan` = '12' and `bulan` = '01') limit 1