app/Http/Controllers/Keuangan/JabatanController.php

    function tampilJabatan(){
        $data = Jabatan::all();
---
select * from `jabatan`